# VertexIndexPair Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
VertexIndexPair Class
Members See Also
---
Represents a connection between vertices in the top and bottom profile of a blend.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class VertexIndexPair
```

Visual Basic
---
```text
Public Class VertexIndexPair
```

Visual C++
---
```text
public ref class VertexIndexPair
```

# Remarks
Use objects of this type in GetVertexConnectionMap()()()(), SetVertexConnectionMap(VertexIndexPairArray), GetVertexConnectionMap()()()() and SetVertexConnectionMap(VertexIndexPairArray) to get/set the vertex connection map.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..VertexIndexPair
# See Also
VertexIndexPair Members
Autodesk.Revit.DB Namespace